{
	window['questions'] = [
		{
			"text": "以下怎样的周末会让你在周一精力充沛",
			"options": [
				{
					"text": "充满社交&外出游玩的周末",
					"bias": "E"
				},
				{
					"text": "独自在自习室&宿舍度过的周末",
					"bias": "I"
				}
			]
		},
		{
			"text": "当老师随机点名&回答问题加平时分时，你希望",
			"options": [
				{
					"text": "老师能够点到自己&主动举手回答问题",
					"bias": "E"
				},
				{
					"text": "老师千万不要点到自己&不愿意举手",
					"bias": "I"
				}
			]
		},
		{
			"text": "当老师要求抢答时，在一定要回答的前提下，你会",
			"options": [
				{
					"text": "先举手站起来再思考",
					"bias": "E"
				},
				{
					"text": "先思考好了再举手",
					"bias": "I"
				}
			]
		},
		{
			"text": "当你在学习阅读后产生一些感悟时，你倾向于",
			"options": [
				{
					"text": "在朋友圈等社交媒体分享自己的思考",
					"bias": "E"
				},
				{
					"text": "只在心里默默思考，不随意在公开平台表露",
					"bias": "I"
				}
			]
		},
		{
			"text": "当你度过精彩而充实的一周&一个月之后，你更喜欢",
			"options": [
				{
					"text": "在社交媒体分享自己的生活日常",
					"bias": "E"
				},
				{
					"text": "只在自己亲密的家人朋友间分享日常",
					"bias": "I"
				}
			]
		},
		{
			"text": "在小组讨论时，你一般",
			"options": [
				{
					"text": "听的比说的多",
					"bias": "E"
				},
				{
					"text": "说的比听得多",
					"bias": "I"
				}
			]
		},
		{
			"text": "当你感到emo时，你更倾向于",
			"options": [
				{
					"text": "和朋友们呆在一起，分享你的情绪",
					"bias": "E"
				},
				{
					"text": "自己独处慢慢消化",
					"bias": "I"
				}
			]
		},
		{
			"text": "在社交场合中，你更倾向于",
			"options": [
				{
					"text": "热情social，主动出击与他人积极交谈",
					"bias": "E"
				},
				{
					"text": "安静应对，不会主动结交陌生人",
					"bias": "I"
				}
			]
		},
		{
			"text": "以下两种问卷方式你更喜欢哪一种",
			"options": [
				{
					"text": "快问快答，大部分问题以回答是或否的方式呈现",
					"bias": "E"
				},
				{
					"text": "慢节奏提问，每一道题在深思熟虑后回答",
					"bias": "I"
				}
			]
		},
		{
			"text": "对于喜欢的多种事物，你更喜欢",
			"options": [
				{
					"text": "追求广度，感兴趣的每一件事都尝试去做",
					"bias": "E"
				},
				{
					"text": "追求深度，将最感兴趣的方向努力做到最好",
					"bias": "I"
				}
			]
		},
		{
			"text": "什么样的情况会更容易促使你开始行动",
			"options": [
				{
					"text": "他人的行为和语言",
					"bias": "E"
				},
				{
					"text": "自己的主观想法",
					"bias": "I"
				}
			]
		},
		{
			"text": "在参加集体活动或聚会时，你通常",
			"options": [
				{
					"text": "很容易投入其中，经常最后一个离开",
					"bias": "E"
				},
				{
					"text": "很容易感觉到疲惫，想要尽快离开",
					"bias": "I"
				}
			]
		},
		{
			"text": "对于聚会的形式来说，你更喜欢",
			"options": [
				{
					"text": "多人聚会和外出活动",
					"bias": "E"
				},
				{
					"text": "少数人聚会和室内活动",
					"bias": "I"
				}
			]
		},
		{
			"text": "在聚会中，你通常",
			"options": [
				{
					"text": "很健谈，可以和大多数人聊到一起",
					"bias": "E"
				},
				{
					"text": "比较安静，只和少数人说话",
					"bias": "I"
				}
			]
		},
		{
			"text": "你在社交场合中，往往",
			"options": [
				{
					"text": "在任何场合中都能快速的结交到新朋友",
					"bias": "E"
				},
				{
					"text": "一般被动的结交到新朋友",
					"bias": "I"
				}
			]
		},
		{
			"text": "对于友谊，你的看法是",
			"options": [
				{
					"text": "希望有很多朋友",
					"bias": "E"
				},
				{
					"text": "有几个要好的朋友就够了",
					"bias": "I"
				}
			]
		},
		{
			"text": "朋友在社交场合中对你意味着",
			"options": [
				{
					"text": "朋友会让我安静一点",
					"bias": "E"
				},
				{
					"text": "朋友会让我更加放开一点",
					"bias": "I"
				}
			]
		},
		{
			"text": "在面临许多选择并作出决定的这一过程中，那一部分会让你更加快乐",
			"options": [
				{
					"text": "作出决定之后会感受到更加快乐",
					"bias": "J"
				},
				{
					"text": "在拥有很多选择之后会感受到更加快乐",
					"bias": "P"
				}
			]
		},
		{
			"text": "在读书周这样的假期时，你通常会",
			"options": [
				{
					"text": "先定计划，先完成工作再玩",
					"bias": "J"
				},
				{
					"text": "随心所欲，先玩再工作",
					"bias": "P"
				}
			]
		},
		{
			"text": "在日常工作和学习过程中，你更喜欢",
			"options": [
				{
					"text": "确定目标，准时坚定的完成",
					"bias": "J"
				},
				{
					"text": "随着新的信息的获取，不断改变目标",
					"bias": "P"
				}
			]
		},
		{
			"text": "当假期旅游时，你更喜欢",
			"options": [
				{
					"text": "提前调查和了解即将要去的环境的情况",
					"bias": "J"
				},
				{
					"text": "不去调查，尽情享受未知的环境",
					"bias": "P"
				}
			]
		},
		{
			"text": "在学习和作业过程中，你更注重",
			"options": [
				{
					"text": "看重结果，重点在于准时完成任务",
					"bias": "J"
				},
				{
					"text": "看重过程，如何去做比结果更重要",
					"bias": "P"
				}
			]
		},
		{
			"text": "当自己的ddl已经确定，但出现一些特殊情况可能无法完成时，你会",
			"options": [
				{
					"text": "定好时间就不更改，一定要在最后期限完成",
					"bias": "J"
				},
				{
					"text": "可以根据情况更改约定和最后期限",
					"bias": "P"
				}
			]
		},
		{
			"text": "在制定计划表并完成这一过程中，你的满足感更多的来自于",
			"options": [
				{
					"text": "能够按照自己制定的计划表完成计划",
					"bias": "J"
				},
				{
					"text": "能够制定计划表并开始行动",
					"bias": "P"
				}
			]
		},
		{
			"text": "当接到来自家人或朋友的旅行邀请，你会",
			"options": [
				{
					"text": "首先查看自己的时间表是否有空",
					"bias": "J"
				},
				{
					"text": "首先思考应该带上哪些行李",
					"bias": "P"
				}
			]
		},
		{
			"text": "对于迟到这件事，你的看法是",
			"options": [
				{
					"text": "应当严格控制时间，任何场合都不喜欢迟到",
					"bias": "J"
				},
				{
					"text": "如果不是非常重要的场合，可以与允许自己迟到",
					"bias": "P"
				}
			]
		},
		{
			"text": "对于约会的内容如何安排这件事，你更喜欢",
			"options": [
				{
					"text": "约会前做好一切安排，包括去哪里吃什么穿什么",
					"bias": "J"
				},
				{
					"text": "随心所欲，到了地方再看情况决定",
					"bias": "P"
				}
			]
		},
		{
			"text": "如果你可以完全按照自己的想法生活，你更希望你的生活是",
			"options": [
				{
					"text": "有计划的，按照计划表的",
					"bias": "J"
				},
				{
					"text": "有弹性的，随性所欲的",
					"bias": "P"
				}
			]
		},
		{
			"text": "在交朋友的过程中，什么样的人是你更欣赏更喜欢的",
			"options": [
				{
					"text": "下定决心做一件事并可以成功做到的人",
					"bias": "J"
				},
				{
					"text": "随时都有多种选择方案并可以随时改进的人",
					"bias": "P"
				}
			]
		},
		{
			"text": "在学习和休闲时，你更喜欢",
			"options": [
				{
					"text": "一个时间段只做一件事情",
					"bias": "J"
				},
				{
					"text": "同时做多件事情",
					"bias": "P"
				}
			]
		},
		{
			"text": "当在课堂上选择课题或作业方向时，你更喜欢",
			"options": [
				{
					"text": "看重并跟随老师的想法或已有先例的方向",
					"bias": "S"
				},
				{
					"text": "看重个人灵感，喜欢创新",
					"bias": "N"
				}
			]
		},
		{
			"text": "在个人创作过程中或观看喜欢作品时，你更看重",
			"options": [
				{
					"text": "现实性和常识性",
					"bias": "S"
				},
				{
					"text": "想象力和独创力",
					"bias": "N"
				}
			]
		},
		{
			"text": "在提升自己的过程中你更喜欢",
			"options": [
				{
					"text": "更加努力的练习和使用已有的技能",
					"bias": "S"
				},
				{
					"text": "喜欢尝试和挑战新的技能",
					"bias": "N"
				}
			]
		},
		{
			"text": "在阅读时，你更喜欢",
			"options": [
				{
					"text": "具体的叙事故事并喜欢细节描述",
					"bias": "S"
				},
				{
					"text": "象征的故事并喜欢隐喻和类比",
					"bias": "N"
				}
			]
		},
		{
			"text": "你更倾向于",
			"options": [
				{
					"text": "着眼于现实",
					"bias": "S"
				},
				{
					"text": "着眼于未来",
					"bias": "N"
				}
			]
		},
		{
			"text": "当给朋友们描述一件事情时，你倾向于",
			"options": [
				{
					"text": "循序渐进地描述事情",
					"bias": "S"
				},
				{
					"text": "以跳跃的方式描述事情",
					"bias": "N"
				}
			]
		},
		{
			"text": "当你在购物时，你会更注重于",
			"options": [
				{
					"text": "要先研究参数并试用，就像买水果要先试吃",
					"bias": "S"
				},
				{
					"text": "个人喜好，喜欢了就买，不用更多思考",
					"bias": "N"
				}
			]
		},
		{
			"text": "在判断一件事时，你更倾向于",
			"options": [
				{
					"text": "通过观察细节和证据得出结论",
					"bias": "S"
				},
				{
					"text": "相信自己的直觉",
					"bias": "N"
				}
			]
		},
		{
			"text": "在与朋友聊天时，你更喜欢聊",
			"options": [
				{
					"text": "实际的现实生活中的事物",
					"bias": "S"
				},
				{
					"text": "未来和种种新的可能性",
					"bias": "N"
				}
			]
		},
		{
			"text": "在了解一件事情时，你会先关注",
			"options": [
				{
					"text": "微观",
					"bias": "S"
				},
				{
					"text": "宏观",
					"bias": "N"
				}
			]
		},
		{
			"text": "当有两个按钮可以选择，一个可以去往未来，一个会保持不变，你会选择",
			"options": [
				{
					"text": "活在当下",
					"bias": "S"
				},
				{
					"text": "去往未来",
					"bias": "N"
				}
			]
		},
		{
			"text": "在与人交往过程中，你会",
			"options": [
				{
					"text": "在现有关系不会改变的情况下，不去思考未来的事",
					"bias": "S"
				},
				{
					"text": "去思考未来的进步空间",
					"bias": "N"
				}
			]
		},
		{
			"text": "在约会之前，你会",
			"options": [
				{
					"text": "不去想象，顺其自然",
					"bias": "S"
				},
				{
					"text": "想象很多可能发生的事",
					"bias": "N"
				}
			]
		},
		{
			"text": "当遇到问题时，你会",
			"options": [
				{
					"text": "客观分析问题，实事求是",
					"bias": "T"
				},
				{
					"text": "更多的思考事情和行为对他人的影响",
					"bias": "F"
				}
			]
		},
		{
			"text": "在处理事情时，你会",
			"options": [
				{
					"text": "对所有人一视同仁，重视公平公正",
					"bias": "T"
				},
				{
					"text": "关注同情与和睦，必要时可以跳过规则以人为本",
					"bias": "F"
				}
			]
		},
		{
			"text": "在处理问题时，你更倾向于",
			"options": [
				{
					"text": "严格要求，一切按照规章标准办事",
					"bias": "T"
				},
				{
					"text": "注重感情，可以适当通融",
					"bias": "F"
				}
			]
		},
		{
			"text": "在交往过程中，你会",
			"options": [
				{
					"text": "直率地讲出自己的想法，喜欢讲大实话",
					"bias": "T"
				},
				{
					"text": "讲话委婉，尽量考虑他人想法",
					"bias": "F"
				}
			]
		},
		{
			"text": "在看影视剧作品和文学作品时，你更喜欢主角",
			"options": [
				{
					"text": "行为和情感都符合逻辑",
					"bias": "T"
				},
				{
					"text": "关系大于一切，为了感情可以不顾逻辑 ",
					"bias": "F"
				}
			]
		},
		{
			"text": "在做事过程中，你的动力更多来自于",
			"options": [
				{
					"text": "成功后可以获得实实在在的好处",
					"bias": "T"
				},
				{
					"text": "成功后可以获得他人的认同和欣赏",
					"bias": "F"
				}
			]
		},
		{
			"text": "当与朋友交谈时对方的观点你并不赞同时，你会",
			"options": [
				{
					"text": "直言不讳，对错分明",
					"bias": "T"
				},
				{
					"text": "委婉暗示或避免提起自己的观点",
					"bias": "F"
				}
			]
		},
		{
			"text": "朋友对你的评价大多为",
			"options": [
				{
					"text": "逻辑清晰，目标明确",
					"bias": "T"
				},
				{
					"text": "热情且细心",
					"bias": "F"
				}
			]
		},
		{
			"text": "对于社交，你认为",
			"options": [
				{
					"text": "社交最重要的是能够实现明确的目标",
					"bias": "T"
				},
				{
					"text": "社交最重要的是开心愉快",
					"bias": "F"
				}
			]
		},
		{
			"text": "在作出决定之前，你会",
			"options": [
				{
					"text": "首先要逻辑通顺才能去想其他的",
					"bias": "T"
				},
				{
					"text": "先依据心意再看逻辑",
					"bias": "F"
				}
			]
		},
		{
			"text": "对于你来说，你更容易察觉到他人",
			"options": [
				{
					"text": "言行是否符合逻辑",
					"bias": "T"
				},
				{
					"text": "情感波动的变化",
					"bias": "F"
				}
			]
		},
		{
			"text": "分手对你来说",
			"options": [
				{
					"text": "下定决心之后可以很快摆脱情绪走出来",
					"bias": "T"
				},
				{
					"text": "很容易深陷其中，很难快速走出来",
					"bias": "F"
				}
			]
		},
		{
			"text": "在与人交往过程中，你更看重",
			"options": [
				{
					"text": "客观和逻辑的交流",
					"bias": "T"
				},
				{
					"text": "情感的交流",
					"bias": "F"
				}
			]
		}
	];
}
