[
	{
		"question": "以下怎样的周末会让你在周一精力充沛",
		"options": [
			"充满社交&外出游玩的周末",
			"独自在自习室&宿舍度过的周末",
		]
	},
	{
		"question": "当老师随机点名&回答问题加平时分时，你希望",
		"options": [
			"老师能够点到自己&主动举手回答问题",
			"老师千万不要点到自己&不愿意举手",
		]
	},
	{
		"question": "当老师要求抢答时，在一定要回答的前提下，你会",
		"options": [
			"先举手站起来再思考",
			"先思考好了再举手",
		]
	},
	{
		"question": "当你在学习阅读后产生一些感悟时，你倾向于",
		"options": [
			"在朋友圈等社交媒体分享自己的思考",
			"只在心里默默思考，不随意在公开平台表露",
		]
	},
	{
		"question": "当你度过精彩而充实的一周&一个月之后，你更喜欢",
		"options": [
			"在社交媒体分享自己的生活日常",
			"只在自己亲密的家人朋友间分享日常",
		]
	},
	{
		"question": "在小组讨论时，你一般",
		"options": [
			"听的比说的多",
			"说的比听得多",
		]
	},
	{
		"question": "当你感到emo时，你更倾向于",
		"options": [
			"和朋友们呆在一起，分享你的情绪",
			"自己独处慢慢消化",
		]
	},
	{
		"question": "在社交场合中，你更倾向于",
		"options": [
			"热情social，主动出击与他人积极交谈",
			"安静应对，不会主动结交陌生人",
		]
	},
	{
		"question": "以下两种问卷方式你更喜欢哪一种",
		"options": [
			"快问快答，大部分问题以回答是或否的方式呈现",
			"慢节奏提问，每一道题在深思熟虑后回答",
		]
	},
	{
		"question": "对于喜欢的多种事物，你更喜欢",
		"options": [
			"追求广度，感兴趣的每一件事都尝试去做",
			"追求深度，将最感兴趣的方向努力做到最好",
		]
	},
	{
		"question": "什么样的情况会更容易促使你开始行动",
		"options": [
			"他人的行为和语言",
			"自己的主观想法",
		]
	},
	{
		"question": "在参加集体活动或聚会时，你通常",
		"options": [
			"很容易投入其中，经常最后一个离开",
			"很容易感觉到疲惫，想要尽快离开",
		]
	},
	{
		"question": "对于聚会的形式来说，你更喜欢",
		"options": [
			"多人聚会和外出活动",
			"少数人聚会和室内活动",
		]
	},
	{
		"question": "在聚会中，你通常",
		"options": [
			"很健谈，可以和大多数人聊到一起",
			"比较安静，只和少数人说话",
		]
	},
	{
		"question": "你在社交场合中，往往",
		"options": [
			"在任何场合中都能快速的结交到新朋友",
			"一般被动的结交到新朋友",
		]
	},
	{
		"question": "对于友谊，你的看法是",
		"options": [
			"希望有很多朋友",
			"有几个要好的朋友就够了",
		]
	},
	{
		"question": "朋友在社交场合中对你意味着",
		"options": [
			"朋友会让我安静一点",
			"朋友会让我更加放开一点",
		]
	},
];